reddit-on-rails/app/views/posts/show.html.erb

<h2> <a href="<%= post_url(@post) %>"><%= @post.title %></a>
by <%= User.find(@post.author_id).username %> </h2>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

<ul>
<% @post.subs.each do |sub| %>
  <li><a href="<%= sub_url(sub) %>"><%= Sub.find(sub.id).title%></a></li>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 17]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]