reddit-on-rails/app/controllers/application_controller.rb

  def current_user
    current_user = User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "FvN_-oF7tXIr2lrLBt3nBw"], ["LIMIT", 1]]