reddit-on-rails/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 15], ["sub_id", 2], ["created_at", "2018-11-21 01:02:51.189566"], ["updated_at", "2018-11-21 01:02:51.189566"]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]

    if @post.save