reddit-on-rails/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "boba"], ["description", "chewiness"], ["mod_id", 3], ["created_at", "2018-11-20 20:03:27.032921"], ["updated_at", "2018-11-20 20:03:27.032921"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.mod_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "BOOBAAAAAAAA!!!"], ["description", "chewiness!!!!"], ["updated_at", "2018-11-20 22:58:44.381136"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.update(sub_params)